"""
Дан текст, за яким слідує крапка. В алфавітному порядку вивести на екран (по разу)
усі малі українські голосні букви, що входять в цей текст.
"""
x ={'а','е','и','о','у','ы','э','ю','я'}
s = input("Введите текст: ")
if s[-1] == '.': 
    a = set(s)
    b = a & x
    print(sorted(b))
else:
    print('error')
