"""
Визначити загальну вартість всіх товарів, випущених в поточному році і
вивести інформацію про ці товари. Поля структури: Найменування, Виробник, Рік
випуску, Кількість, Ціна.
"""
tovar = {
    'novela':
    {'продавец':'urkaine',
     'год':2020,
     'колличество':375,
     'Цена':250,
     'data':7.2},
    'roman':
    {'продавец':'france',
     'год':2020,
     'колличество':240,
     'Цена':370,
     'data':19.5}
    }
summa = 0
for k in tovar:
    if tovar[k]['год'] == 2020:
        summa+=tovar[k]['колличество']
print('колличество = ' + str(summa))
print(tovar)
